In [14]:
mystudents={"StudentName":["Gaurav","Aneesha","Neha","Poorva","Dhruv","Ashish","Saurav"],
            "Lucky":[5,9,8,2,6,20,30]
            ,"distance":[2,5,4,6,7,20,10]}
print(mystudents)

{'StudentName': ['Gaurav', 'Aneesha', 'Neha', 'Poorva', 'Dhruv', 'Ashish', 'Saurav'], 'Lucky': [5, 9, 8, 2, 6, 20, 30], 'distance': [2, 5, 4, 6, 7, 20, 10]}

In [15]:
import pandas as pd

In [25]:
df1=pd.DataFrame(mystudents)
df1

  StudentName  Lucky  distance
0      Gaurav      5         2
1     Aneesha      9         5
2        Neha      8         4
3      Poorva      2         6
4       Dhruv      6         7
5      Ashish     20        20
6      Saurav     30        10

In [26]:
df1.at[6,'Lucky']=11

In [18]:
df1.update(df2)
df1

  StudentName  Lucky  distance
0      Gaurav      5         2
1     Aneesha      9         5
2        Neha      8         4
3      Poorva      2         6
4       Dhruv      6         7
5      Ashish     20        20
6      Saurav     30        10

In [27]:
df1

  StudentName  Lucky  distance
0      Gaurav      5         2
1     Aneesha      9         5
2        Neha      8         4
3      Poorva      2         6
4       Dhruv      6         7
5      Ashish     20        20
6      Saurav     11        10